zephyrproject-rtos/hal_espressif/zephyr/esp32c2/src/bt/esp_bt_adapter.c
static modem_clock_lpclk_src_t ble_rtc_clk_init(esp_bt_controller_config_t *cfg)
{
	if (s_bt_lpclk_src == MODEM_CLOCK_LPCLK_SRC_INVALID) {
#if CONFIG_ESP32_BT_LE_LP_CLK_SRC_MAIN_XTAL
		s_bt_lpclk_src = MODEM_CLOCK_LPCLK_SRC_MAIN_XTAL;
#else
		soc_rtc_slow_clk_src_t slow_clk_src = rtc_clk_slow_src_get();

		switch (slow_clk_src) {
		case SOC_RTC_SLOW_CLK_SRC_RC_SLOW:
			s_bt_lpclk_src = MODEM_CLOCK_LPCLK_SRC_RC_SLOW;
			break;
		case SOC_RTC_SLOW_CLK_SRC_OSC_SLOW:
			s_bt_lpclk_src = MODEM_CLOCK_LPCLK_SRC_EXT32K;
			break;
		default:
			LOG_WRN("Unsupported slow clock source, fall back to "
				"main XTAL as Bluetooth sleep clock");
			s_bt_lpclk_src = MODEM_CLOCK_LPCLK_SRC_MAIN_XTAL;
			break;
		}
#endif /* CONFIG_ESP32_BT_LE_LP_CLK_SRC_MAIN_XTAL */
	}

	if (s_bt_lpclk_src == MODEM_CLOCK_LPCLK_SRC_EXT32K) {
		cfg->rtc_freq = 32768;
	} else if (s_bt_lpclk_src == MODEM_CLOCK_LPCLK_SRC_MAIN_XTAL) {
		cfg->rtc_freq = s_bt_lpclk_freq;
	} else if (s_bt_lpclk_src == MODEM_CLOCK_LPCLK_SRC_RC_SLOW) {
		cfg->rtc_freq = esp_clk_tree_lp_slow_get_freq_hz(ESP_CLK_TREE_SRC_FREQ_PRECISION_CACHED) / 5;
		cfg->ble_ll_sca = 3000;
	}
	esp_bt_rtc_slow_clk_select(s_bt_lpclk_src);
	return s_bt_lpclk_src;
}

esp_err_t esp_bt_controller_init(esp_bt_controller_config_t *cfg)
{
	esp_err_t ret = ESP_OK;
	ble_npl_count_info_t npl_info;
	modem_clock_lpclk_src_t rtc_clk_src;
	uint8_t hci_transport_mode;

	memset(&npl_info, 0, sizeof(ble_npl_count_info_t));
	if (ble_controller_status != ESP_BT_CONTROLLER_STATUS_IDLE) {
		LOG_WRN("invalid controller state");
		return ESP_ERR_INVALID_STATE;
	}

	if (!cfg) {
		LOG_WRN("cfg is NULL");
		return ESP_ERR_INVALID_ARG;
	}

	rtc_clk_src = ble_rtc_clk_init(cfg);

	ret = esp_register_ext_funcs(&ext_funcs_ro);
	if (ret != ESP_OK) {
		LOG_WRN("register extend functions failed");
		return ret;
	}

	/* If we place the ble code into flash, don't need to initialize ROM. */
#if !CONFIG_BT_CTRL_RUN_IN_FLASH_ONLY
#if DEFAULT_BT_LE_50_FEATURE_SUPPORT || DEFAULT_BT_LE_ROLE_CENTROL || DEFAULT_BT_LE_ROLE_OBSERVER
	extern int esp_ble_rom_func_ptr_init_all(void);
	esp_ble_rom_func_ptr_init_all();
#else
	LOG_INF("Init only legacy adv and slave function");
	extern int esp_ble_rom_func_ptr_init_legacy_adv_and_slave(void);
	esp_ble_rom_func_ptr_init_legacy_adv_and_slave();
#endif
#endif //!CONFIG_BT_CTRL_RUN_IN_FLASH_ONLY

	/* Initialize the function pointers for OS porting */
	npl_zephyr_funcs_init();
	struct npl_funcs_t *p_npl_funcs = npl_zephyr_funcs_get();
	if (!p_npl_funcs) {
		LOG_WRN("npl functions get failed");
		return ESP_ERR_INVALID_ARG;
	}

	ret = esp_register_npl_funcs(p_npl_funcs);
	if (ret != ESP_OK) {
		LOG_WRN("npl functions register failed");
		goto free_mem;
	}

	ble_get_npl_element_info(cfg, &npl_info);
	npl_zephyr_set_controller_npl_info(&npl_info);
	if (npl_zephyr_mempool_init() != 0) {
		LOG_WRN("npl mempool init failed");
		ret = ESP_ERR_INVALID_ARG;
		goto free_mem;
	}

	/* Initialize the global memory pool */
	ret = os_msys_buf_alloc();
	if (ret != ESP_OK) {
		LOG_WRN("os msys alloc failed");
		goto free_mem;
	}

	os_msys_init();
#if CONFIG_BT_NIMBLE_ENABLED
	// ble_npl_eventq_init() need to use npl function in rom and must be called after esp_bt_controller_init()
	/* Initialize default event queue */
	ble_npl_eventq_init(nimble_port_get_dflt_eventq());
#endif
	esp_phy_modem_init();
	periph_module_enable(PERIPH_BT_MODULE);
	periph_module_reset(PERIPH_BT_MODULE);

	if (ble_osi_coex_funcs_register((struct osi_coex_funcs_t *)&s_osi_coex_funcs_ro) != 0) {
		LOG_WRN("osi coex funcs reg failed");
		ret = ESP_ERR_INVALID_ARG;
		goto modem_deint;
	}

#if CONFIG_SW_COEXIST_ENABLE
	coex_init();
#endif

#if CONFIG_BT_CTRL_RUN_IN_FLASH_ONLY
	ble_ll_supported_features_init();
#endif //CONFIG_BT_CTRL_RUN_IN_FLASH_ONLY

	ret = ble_controller_init(cfg);
	if (ret != ESP_OK) {
		LOG_WRN("ble_controller_init failed %d", ret);
		goto modem_deint;
	}

#if CONFIG_ESP32_BT_LE_LL_PEER_SCA_SET_ENABLE
	r_ble_ll_customize_peer_sca_set(CONFIG_ESP32_BT_LE_LL_PEER_SCA);
#endif // CONFIG_ESP32_BT_LE_LL_PEER_SCA_SET_ENABLE

	LOG_INF("ble controller commit:[%s]", ble_controller_get_compile_version());
	LOG_INF("ble rom commit:[%s]", r_ble_controller_get_rom_compile_version());

	ret = controller_sleep_init(rtc_clk_src);
	if (ret != ESP_OK) {
		LOG_WRN("controller_sleep_init failed %d", ret);
		goto free_controller;
	}

	uint8_t mac[6];
	ESP_ERROR_CHECK(esp_read_mac((uint8_t *)mac, ESP_MAC_BT));

	LOG_INF("Bluetooth MAC: %02x:%02x:%02x:%02x:%02x:%02x",
			 mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);

	swap_in_place(mac, 6);

	esp_ble_ll_set_public_addr(mac);

	ble_controller_status = ESP_BT_CONTROLLER_STATUS_INITED;

#if CONFIG_ESP32_BT_LE_HCI_INTERFACE_USE_RAM
	hci_transport_mode = HCI_TRANSPORT_VHCI;
#elif CONFIG_ESP32_BT_LE_HCI_INTERFACE_USE_UART
	hci_transport_mode = HCI_TRANSPORT_UART_NO_DMA;
#endif // CONFIG_ESP32_BT_LE_HCI_INTERFACE_USE_RAM
	ret = hci_transport_init(hci_transport_mode);
	if (ret) {
		LOG_WRN("hci transport init failed %d", ret);
		goto free_controller;
	}
	return ESP_OK;
free_controller:
	hci_transport_deinit();
	controller_sleep_deinit();
	ble_controller_deinit();
modem_deint:
	esp_phy_modem_deinit();
	periph_module_disable(PERIPH_BT_MODULE);
#if CONFIG_BT_NIMBLE_ENABLED
	ble_npl_eventq_deinit(nimble_port_get_dflt_eventq());
#endif // CONFIG_BT_NIMBLE_ENABLED
free_mem:
	os_msys_buf_free();
	npl_zephyr_mempool_deinit();
	esp_unregister_npl_funcs();
	npl_zephyr_funcs_deinit();
	esp_unregister_ext_funcs();
	return ret;
}

esp_err_t esp_bt_controller_deinit(void)
{
	if ((ble_controller_status < ESP_BT_CONTROLLER_STATUS_INITED) || (ble_controller_status >= ESP_BT_CONTROLLER_STATUS_ENABLED)) {
		LOG_WRN("invalid controller state");
		return ESP_FAIL;
	}

	hci_transport_deinit();
	controller_sleep_deinit();

	ble_controller_deinit();

	periph_module_disable(PERIPH_BT_MODULE);

#if CONFIG_BT_NIMBLE_ENABLED
	/* De-initialize default event queue */
	ble_npl_eventq_deinit(nimble_port_get_dflt_eventq());
#endif
	os_msys_buf_free();

